part_i/notes/15UnionFind.html
<!doctype html>
<html lang="en">
<head>
<title>Union Find Notes</title>
<!-- 2017-12-03 Sun 20:45 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Andrew Jarrett">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Union Find Notes</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://github.com/ahrjarrett/analysis_of_algorithms/blob/master/part_i/lectures/15UnionFind.pdf">Lecture 1.5: Union Find Lecture Slides</a></h2>
<div class="outline-text-2" id="text-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">lecture #</th>
<th scope="col" class="text-left">link/title</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">video 1</td>
<td class="text-left"><a href="https://www.coursera.org/learn/algorithms-part1/lecture/fjxHC/dynamic-connectivity">Dynamic Connectivity</a></td>
</tr>

<tr>
<td class="text-left">video 2</td>
<td class="text-left"><a href="https://www.coursera.org/learn/algorithms-part1/lecture/EcF3P/quick-find">Quick Find</a></td>
</tr>

<tr>
<td class="text-left">video 3</td>
<td class="text-left"><a href="https://www.coursera.org/learn/algorithms-part1/lecture/ZgecU/quick-union">Quick Union</a></td>
</tr>

<tr>
<td class="text-left">video 4</td>
<td class="text-left"><a href="https://www.coursera.org/learn/algorithms-part1/lecture/RZW72/quick-union-improvements">Quick Union Improvements</a></td>
</tr>

<tr>
<td class="text-left">video 5</td>
<td class="text-left"><a href="https://www.coursera.org/learn/algorithms-part1/lecture/OLXM8/union-find-applications">Union Find Applications</a></td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Dynamic connectivity</h2>
<div class="outline-text-2" id="text-2">
<p>
Notes from Video 1:
</p>

<p>
We will be taking a <b>scientific approach</b>
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Given a set of N objects:</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Union command: Connect two objects
</li>
<li>Find/connected query: is there a path connecting the two objects?
</li>
</ol>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">slide 4:</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">4</span>, <span style="color: #D0372D;">3</span><span style="color: #707183;">)</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">3</span>, <span style="color: #D0372D;">8</span><span style="color: #707183;">)</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">6</span>, <span style="color: #D0372D;">5</span><span style="color: #707183;">)</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">9</span>, <span style="color: #D0372D;">4</span><span style="color: #707183;">)</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">2</span>, <span style="color: #D0372D;">1</span><span style="color: #707183;">)</span>
connected<span style="color: #707183;">(</span><span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">7</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">false</span>
connected<span style="color: #707183;">(</span><span style="color: #D0372D;">8</span>, <span style="color: #D0372D;">9</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">true</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">5</span>, <span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">7</span>, <span style="color: #D0372D;">2</span><span style="color: #707183;">)</span>
union<span style="color: #707183;">(</span><span style="color: #D0372D;">1</span>, <span style="color: #D0372D;">0</span><span style="color: #707183;">)</span>
connected<span style="color: #707183;">(</span><span style="color: #D0372D;">0</span>, <span style="color: #D0372D;">7</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">true</span>
</pre>
</div>

<p>
Question: Is there a path connecting <code>p</code> and <code>q</code>?
</p>

<p>
The algorithm we’re looking at will not return the actual path, but whether there <i>is</i> a path
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Modeling the objects:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Applications involve manipulating objects of all types:</b>
</p>

<ul class="org-ul">
<li>Pixels in a digital photo
</li>
<li>Computers in a network
</li>
<li>Friends in a social network
</li>
<li>Transistors in a computer chip
</li>
<li>Elements in a mathematical set
</li>
<li>Variable names in Fortran program
</li>
<li>Metallic sites in a composite system
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Modeling the connections</h3>
<div class="outline-text-3" id="text-2-3">
<p>
We assume “is connected to” is an <a href="https://en.wikipedia.org/wiki/Equivalence_relation">Equivalence Relation</a>
</p>

<ul class="org-ul">
<li><b>Reflexive:</b> <code>p</code> is connected to <code>p</code>
</li>
<li><b>Symmetric:</b> if <code>p</code> is connected to <code>q</code>, then <code>q</code> is connected to <code>p</code>
</li>
<li><b>Transitive:</b> if <code>p</code> is connected to <code>q</code> and <code>q</code> is connected to <code>r</code>, then <code>p</code> is connected to <code>r</code>
</li>
</ul>

<p>
<b>Connected components:</b> Maximal <code>set</code> of objects that are mutually connected
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Implementing the operations</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<b>Find query:</b> Check if two objects are in the same component.
<b>Union command:</b> Replace components containing two objects with their union.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #006699;">union</span><span style="color: #707183;">(</span><span style="color: #D0372D;">2</span>, <span style="color: #D0372D;">5</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">BEFORE:</span>
<span style="color: #707183;">{</span> <span style="color: #D0372D;">0</span> <span style="color: #707183;">}</span> <span style="color: #707183;">{</span> <span style="color: #D0372D;">1</span> <span style="color: #D0372D;">4</span> <span style="color: #D0372D;">5</span><span style="color: #707183;">}</span> <span style="color: #707183;">{</span> <span style="color: #D0372D;">2</span> <span style="color: #D0372D;">3</span> <span style="color: #D0372D;">6</span> <span style="color: #D0372D;">7</span> <span style="color: #707183;">}</span>

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">AFTER:</span>
<span style="color: #707183;">{</span> <span style="color: #D0372D;">0</span> <span style="color: #707183;">}</span> <span style="color: #707183;">{</span> <span style="color: #D0372D;">1</span> <span style="color: #D0372D;">2</span> <span style="color: #D0372D;">3</span> <span style="color: #D0372D;">4</span> <span style="color: #D0372D;">5</span> <span style="color: #D0372D;">6</span> <span style="color: #D0372D;">7</span> <span style="color: #707183;">}</span>
</pre>
</div>

<p>
All of this leads up to a specification of a data-type.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Union-find data type (API)</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<b>Goal:</b> Design efficient data structure for union-find.
</p>

<ul class="org-ul">
<li>Number of objects <i>N</i> can be huge.
</li>
<li>Number of operations <i>M</i> can be huge.
</li>
<li>Find queries and union commands may be intermixed.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">UF</span>
<span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">UnionFind API */</span>
<span style="color: #6434A3;">UF</span><span style="color: #707183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">N</span><span style="color: #707183;">)</span>                        <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">initialize union-find data structure with N objects (0 to N-1)</span>
<span style="color: #6434A3;">void</span> union<span style="color: #707183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">q</span><span style="color: #707183;">)</span>         <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">add connection btwn p and q</span>
<span style="color: #6434A3;">boolean</span> connected<span style="color: #707183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">q</span><span style="color: #707183;">)</span>  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">are p and q in the same component?</span>
<span style="color: #6434A3;">int</span> find<span style="color: #707183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span><span style="color: #707183;">)</span>                  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">component identifier for p(0 to N-1)</span>
<span style="color: #6434A3;">int</span> count<span style="color: #707183;">()</span>                      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">number of components</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Dynamic-connetivity client</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Read in number of objects <i>N</i> from standard input
</li>
<li>Repeat:
<ol class="org-ol">
<li>Read in pair of integers from standard input
</li>
<li>If they are not yet connected, connect them and print out pair
</li>
</ol>
</li>
</ul>
</div>
</div>
