part_i/notes/15UnionFind.org
*** Code: Dynamic-connectivity client

#+BEGIN_SRC java
  public static void main(String[] args)
  {
      int N = StdIn.readInt();
      UF uf = UF(N);
      while (!StdIn.isEmpty());
      {
          int p = StdIn.readInt();
          int q = StdIn.readInt();
          if (!uf.connected(p, q))
          {
              uf.union(p, q);
              StdOut.println(p + " " + q);
          }
      }
  }
#+END_SRC

This is /client code/, which means we’re able to actually run and test our code to make sure it works (which is what that code block above is all about).

End of video.


** Quick Find

*** Initializing the Data Structure

When implementing the =union(p, q)= and =connected(p, q)=, we’re going to initialize the array where each value’s index is also its value (representative of the the point’s /reflexivity/).

*** Representing a connection

In order to represent a connection, we change the value at =p= and =q= to the “entry point”, which is chosen arbitrarily.

#+BEGIN_SRC java
// Start: { 0 1 2 3 4 5 6 7 8 9 }

union(5, 4)
// { 0 1 2 3 4 4 6 7 8 9 }

union(4, 9)
// { 0 1 2 3 4 4 6 7 8 4 }
#+END_SRC

> Note: this seems like a somewhat nieve approach, but I think it’s time complexity is O(n), right?

*** Code: Quick Find

#+BEGIN_SRC java
public class QuickFindUF
{
  private int[] id;

  // This is the constructor:
  public QuickFindUF(int N)
  {
    id = new Int(N);
    for (int i = 0; i < N; i++)
    id[i] = i;
  }

  public boolean connected(int p, int q)
  {
    return id[p] === id[q];
  }

  // change all entries with id[p] to id[q]
  // time complexity: at most 2N plus 2 array accesses
  public void union(int p, int q)
  {
    int pid = id[p];
    int qid = id[q];
    for(int i = 0; i < id.length; i++)
      if(id[i] == pid) id[i] = qid;
  }
}
#+END_SRC

*** Time Complexity: Quick Find

Quick-find is too slow. Specifically the quick-find defect: Union is too expensive.

| algorithm  | initialize | union | find |
|------------+------------+-------+------|
| quick-find | N        | N   | 1    |

Example: Takes N^2 (quadratic) array accesses to process sequence of N union commands on N objects.


** Quick Union
   :LOGBOOK:
   CLOCK: [2017-12-03 Sun 16:51]--[2017-12-03 Sun 17:16] =>  0:25
   CLOCK: [2017-12-03 Sun 15:53]--[2017-12-03 Sun 16:18] =>  0:25
   :END:

Quick-union is a /lazy approach/.

*** Data structure

- Integer array =id[]= of size N.
- Interpretation: id[i] is parent of i.
- Root of i is =id[id[id[...id[i]...]]]=. Keep going until it doesn’t change (algorithm ensures no cycles).

Each node is going to contain a reference to its parent. This is essentially the same data structure as before, but we can think of it as more like a tree (or a /forest/).

*** Find Implementation

So if we want to implement =find=, we need to check if =p= and =q= have the same root.

*** Union Implementation

To merge components containing =p= and =q=, set the id of =p’s= root to the id of =q’s= root. With these implementations in mind, which method is going to be more difficult to implement? This time, /find is more difficult/ because we have to figure out a way to check up the chain to find a common ancestor. In the case of merge (a.k.a. quick-union), we only have to change the value of 1 node.

*Put differently:* If we run =union(3, 8)=, all we do is take the first item and make it a child of the second item (so now 3 points to 8, which points to itself). Then if we do =union(9, 4)=, 9 finds 4’s root, which is 8, and now 9 points to 8.

