part_i/notes/15UnionFind.html

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Code: Dynamic-connectivity client</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span><span style="color: #707183;">(</span><span style="color: #6434A3;">String</span><span style="color: #7388D6;">[]</span> <span style="color: #BA36A5;">args</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">N</span> = StdIn.readInt<span style="color: #7388D6;">()</span>;
    <span style="color: #6434A3;">UF</span> <span style="color: #BA36A5;">uf</span> = UF<span style="color: #7388D6;">(</span>N<span style="color: #7388D6;">)</span>;
    <span style="color: #0000FF;">while</span> <span style="color: #7388D6;">(</span>!StdIn.isEmpty<span style="color: #909183;">()</span><span style="color: #7388D6;">)</span>;
    <span style="color: #7388D6;">{</span>
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span> = StdIn.readInt<span style="color: #909183;">()</span>;
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">q</span> = StdIn.readInt<span style="color: #909183;">()</span>;
        <span style="color: #0000FF;">if</span> <span style="color: #909183;">(</span>!uf.connected<span style="color: #709870;">(</span>p, q<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">{</span>
            uf.union<span style="color: #709870;">(</span>p, q<span style="color: #709870;">)</span>;
            StdOut.println<span style="color: #709870;">(</span>p + <span style="color: #008000;">" "</span> + q<span style="color: #709870;">)</span>;
        <span style="color: #909183;">}</span>
    <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
This is <i>client code</i>, which means we’re able to actually run and test our code to make sure it works (which is what that code block above is all about).
</p>

<p>
End of video.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Quick Find</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Initializing the Data Structure</h3>
<div class="outline-text-3" id="text-3-1">
<p>
When implementing the <code>union(p, q)</code> and <code>connected(p, q)</code>, we’re going to initialize the array where each value’s index is also its value (representative of the the point’s <i>reflexivity</i>).
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Representing a connection</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In order to represent a connection, we change the value at <code>p</code> and <code>q</code> to the “entry point”, which is chosen arbitrarily.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Start: { 0 1 2 3 4 5 6 7 8 9 }</span>

union<span style="color: #707183;">(</span><span style="color: #D0372D;">5</span>, <span style="color: #D0372D;">4</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">{ 0 1 2 3 4 4 6 7 8 9 }</span>

union<span style="color: #707183;">(</span><span style="color: #D0372D;">4</span>, <span style="color: #D0372D;">9</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">{ 0 1 2 3 4 4 6 7 8 4 }</span>
</pre>
</div>

<p>
&gt; Note: this seems like a somewhat nieve approach, but I think it’s time complexity is O(n), right?
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Code: Quick Find</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">QuickFindUF</span>
<span style="color: #707183;">{</span>
  <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span><span style="color: #7388D6;">[]</span> <span style="color: #BA36A5;">id</span>;

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">This is the constructor:</span>
  <span style="color: #0000FF;">public</span> <span style="color: #006699;">QuickFindUF</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">N</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">{</span>
    id = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Int</span><span style="color: #909183;">(</span>N<span style="color: #909183;">)</span>;
    <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = <span style="color: #D0372D;">0</span>; i &lt; <span style="color: #6434A3;">N</span>; i++<span style="color: #909183;">)</span>
    id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = i;
  <span style="color: #7388D6;">}</span>

  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">boolean</span> <span style="color: #006699;">connected</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">q</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">{</span>
    <span style="color: #0000FF;">return</span> id<span style="color: #909183;">[</span>p<span style="color: #909183;">]</span> === id<span style="color: #909183;">[</span>q<span style="color: #909183;">]</span>;
  <span style="color: #7388D6;">}</span>

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">change all entries with id[p] to id[q]</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">time complexity: at most 2N plus 2 array accesses</span>
  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">union</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">q</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">{</span>
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">pid</span> = id<span style="color: #909183;">[</span>p<span style="color: #909183;">]</span>;
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">qid</span> = id<span style="color: #909183;">[</span>q<span style="color: #909183;">]</span>;
    <span style="color: #0000FF;">for</span><span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = <span style="color: #D0372D;">0</span>; i &lt; id.<span style="color: #6434A3;">length</span>; i++<span style="color: #909183;">)</span>
      <span style="color: #0000FF;">if</span><span style="color: #909183;">(</span>id<span style="color: #709870;">[</span>i<span style="color: #709870;">]</span> == pid<span style="color: #909183;">)</span> id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = qid;
  <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Time Complexity: Quick Find</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Quick-find is too slow. Specifically the quick-find defect: Union is too expensive.
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="right">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">algorithm</th>
<th scope="col" class="text-left">initialize</th>
<th scope="col" class="text-left">union</th>
<th scope="col" class="text-right">find</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">quick-find</td>
<td class="text-left">N</td>
<td class="text-left">N</td>
<td class="text-right">1</td>
</tr>
</tbody>
</table>

<p>
Example: Takes N<sup>2</sup> (quadratic) array accesses to process sequence of N union commands on N objects.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Quick Union</h2>
<div class="outline-text-2" id="text-4">
<p>
Quick-union is a <i>lazy approach</i>.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Data structure</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Integer array <code>id[]</code> of size N.
</li>
<li>Interpretation: id[i] is parent of i.
</li>
<li>Root of i is <code>id[id[id[...id[i]...]]]</code>. Keep going until it doesn’t change (algorithm ensures no cycles).
</li>
</ul>

<p>
Each node is going to contain a reference to its parent. This is essentially the same data structure as before, but we can think of it as more like a tree (or a <i>forest</i>).
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Find Implementation</h3>
<div class="outline-text-3" id="text-4-2">
<p>
So if we want to implement <code>find</code>, we need to check if <code>p</code> and <code>q</code> have the same root.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Union Implementation</h3>
<div class="outline-text-3" id="text-4-3">
<p>
To merge components containing <code>p</code> and <code>q</code>, set the id of <code>p’s</code> root to the id of <code>q’s</code> root. With these implementations in mind, which method is going to be more difficult to implement? This time, <i>find is more difficult</i> because we have to figure out a way to check up the chain to find a common ancestor. In the case of merge (a.k.a. quick-union), we only have to change the value of 1 node.
</p>

<p>
<b>Put differently:</b> If we run <code>union(3, 8)</code>, all we do is take the first item and make it a child of the second item (so now 3 points to 8, which points to itself). Then if we do <code>union(9, 4)</code>, 9 finds 4’s root, which is 8, and now 9 points to 8.
</p>
</div>
</div>
