part_i/notes/15UnionFind.org
*** Code: Quick Union

#+BEGIN_SRC java
public class QuickUnionUF
{
  private int[] id;

  public QuickUnionUF(int N)
  {
    id = new int[N];
    // set id of each object to itself (N array access)
    for (int i = 0; i < N; i++) id[i] = i;
  }

  public int root(int i)
  {
    // chase parent pointers until reach root (depth of i array accesses)
    while (i != id[i]) i = id[i];
    return i;
  }

  public boolean connected(int p, int q)
  {
    // check if p and q have same root (depth of p and q array accesses)
    return root(p) === root(q);
  }

  public void union(int p, int q)
  {
    // change root of p to point to root of q (depth of p and q array accesses)
    int i = root(p);
    int j = root(q);
    id[i] = j;
  }
}
#+END_SRC

*** Time Complexity: Quick Union

Unfortunately, quick-union is also too slow.

**** Cost model:

| algorithm   | initialize | union | find |
|-------------+------------+-------+------|
| quick-find  | N          | N     | 1    |
| quick-union | N          | N†    | N    |

  † includes cost of finding roots

**** Quick-find defect
- Union too expensive (N array accesses).
- Trees are flat, but too expensive to keep them flat.

**** Quick-union defect
- Trees can get tall.
- Find too expensive (could be N array accesses).





** Quick Union Improvements

*** Improvement 1: Weighting

*Weighted quick-union.*

- Modify quick-union to avoid tall trees.
- Keep track of size of each tree (number of objects).
- Balance by linking root of smaller tree to root of larger tree. <- Reasonable alternatives: union by height or “rank”

*** Java Implementation

*Data structure:* Same as quick union, but maintain extra array =sz[i]= to count number of objects in the tree rooted at =i=.

*Find:* Identical to quick union.

#+BEGIN_SRC java
return root(p) === root(q);
#+END_SRC

*Union:* Modify quick union to:
- Link root of smaller tree to root of larger tree.
- Update the =sz[]= array.

#+BEGIN_SRC java
int i = root(p);
int j = root(q);
if (i === j) return;
if (sz[i] < sz[j]) { id[i] = j; sz[j] += sz[i]; }
else               { id[j] = i; sz[i] += sz[j]; }
#+END_SRC

*** Weighted Quick Union Analysis

*Running time:*
- Find: takes time proportional to depth of =p= and =q=.
- Union: takes constant time, given roots.

*Proposition:* Depth of any node =x= is at most =lg N= (logarithm base 2 is always represented as =lg N=).

*Pf:* When does depth of =x= increase?

Increases by 1 when tree =T1= containing =x= is merged into another tree =T2=.

- The size of the tree containing =x= at least doubles since:

#+BEGIN_SRC
|T2| >= |T1|
#+END_SRC

- Size of tree containing =x= can double at most =log N= times. Why?

That means that, in order to have a tree that is 30 levels deep, we would need to have an =N= of over 1 billion:

#+BEGIN_SRC
Math.pow(2, 30) // 1073741824
#+END_SRC

*Running time.*
- Find: takes time proportional to depth of =p= and =q=.
- Union: takes constant time, given roots.

*Proposition:* Depth of any node =x= is at most =lg N=.

| algorithm   | intiailize | union  | connected |
|-------------+------------+--------+-----------|
| quick find  | N          | N      | 1         |
| quick union | N          | N †    | N         |
| weighted QU | N          | lg N † | lg N      |

  † includes cost of finding roots

*Q.* Stop at guaranteed acceptable performance?
*A.* No, easy to improve further.

