part_i/notes/15UnionFind.html

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Code: Quick Union</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">QuickUnionUF</span>
<span style="color: #707183;">{</span>
  <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span><span style="color: #7388D6;">[]</span> <span style="color: #BA36A5;">id</span>;

  <span style="color: #0000FF;">public</span> <span style="color: #006699;">QuickUnionUF</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">N</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">{</span>
    id = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">int</span><span style="color: #909183;">[</span>N<span style="color: #909183;">]</span>;
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">set id of each object to itself (N array access)</span>
    <span style="color: #0000FF;">for</span> <span style="color: #909183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = <span style="color: #D0372D;">0</span>; i &lt; <span style="color: #6434A3;">N</span>; i++<span style="color: #909183;">)</span> id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = i;
  <span style="color: #7388D6;">}</span>

  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">root</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">{</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">chase parent pointers until reach root (depth of i array accesses)</span>
    <span style="color: #0000FF;">while</span> <span style="color: #909183;">(</span>i != id<span style="color: #709870;">[</span>i<span style="color: #709870;">]</span><span style="color: #909183;">)</span> i = id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span>;
    <span style="color: #0000FF;">return</span> i;
  <span style="color: #7388D6;">}</span>

  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">boolean</span> <span style="color: #006699;">connected</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">q</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">{</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">check if p and q have same root (depth of p and q array accesses)</span>
    <span style="color: #0000FF;">return</span> root<span style="color: #909183;">(</span>p<span style="color: #909183;">)</span> === root<span style="color: #909183;">(</span>q<span style="color: #909183;">)</span>;
  <span style="color: #7388D6;">}</span>

  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">union</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">p</span>, <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">q</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">{</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">change root of p to point to root of q (depth of p and q array accesses)</span>
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = root<span style="color: #909183;">(</span>p<span style="color: #909183;">)</span>;
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">j</span> = root<span style="color: #909183;">(</span>q<span style="color: #909183;">)</span>;
    id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = j;
  <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Time Complexity: Quick Union</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Unfortunately, quick-union is also too slow.
</p>
</div>

<div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Cost model:</h4>
<div class="outline-text-4" id="text-4-5-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">algorithm</th>
<th scope="col" class="text-left">initialize</th>
<th scope="col" class="text-left">union</th>
<th scope="col" class="text-left">find</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">quick-find</td>
<td class="text-left">N</td>
<td class="text-left">N</td>
<td class="text-left">1</td>
</tr>

<tr>
<td class="text-left">quick-union</td>
<td class="text-left">N</td>
<td class="text-left">N†</td>
<td class="text-left">N</td>
</tr>
</tbody>
</table>

<p>
† includes cost of finding roots
</p>
</div>
</div>

<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> Quick-find defect</h4>
<div class="outline-text-4" id="text-4-5-2">
<ul class="org-ul">
<li>Union too expensive (N array accesses).
</li>
<li>Trees are flat, but too expensive to keep them flat.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-5-3" class="outline-4">
<h4 id="sec-4-5-3"><span class="section-number-4">4.5.3</span> Quick-union defect</h4>
<div class="outline-text-4" id="text-4-5-3">
<ul class="org-ul">
<li>Trees can get tall.
</li>
<li>Find too expensive (could be N array accesses).
</li>
</ul>
</div>
</div>
</div>
</div>





<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Quick Union Improvements</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Improvement 1: Weighting</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>Weighted quick-union.</b>
</p>

<ul class="org-ul">
<li>Modify quick-union to avoid tall trees.
</li>
<li>Keep track of size of each tree (number of objects).
</li>
<li>Balance by linking root of smaller tree to root of larger tree. &lt;- Reasonable alternatives: union by height or “rank”
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Java Implementation</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<b>Data structure:</b> Same as quick union, but maintain extra array <code>sz[i]</code> to count number of objects in the tree rooted at <code>i</code>.
</p>

<p>
<b>Find:</b> Identical to quick union.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">return</span> root<span style="color: #707183;">(</span>p<span style="color: #707183;">)</span> === root<span style="color: #707183;">(</span>q<span style="color: #707183;">)</span>;
</pre>
</div>

<p>
<b>Union:</b> Modify quick union to:
</p>
<ul class="org-ul">
<li>Link root of smaller tree to root of larger tree.
</li>
<li>Update the <code>sz[]</code> array.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = root<span style="color: #707183;">(</span>p<span style="color: #707183;">)</span>;
<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">j</span> = root<span style="color: #707183;">(</span>q<span style="color: #707183;">)</span>;
<span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>i === j<span style="color: #707183;">)</span> <span style="color: #0000FF;">return</span>;
<span style="color: #0000FF;">if</span> <span style="color: #707183;">(</span>sz<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> &lt; sz<span style="color: #7388D6;">[</span>j<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span> id<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> = j; sz<span style="color: #7388D6;">[</span>j<span style="color: #7388D6;">]</span> += sz<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span>; <span style="color: #707183;">}</span>
<span style="color: #0000FF;">else</span>               <span style="color: #707183;">{</span> id<span style="color: #7388D6;">[</span>j<span style="color: #7388D6;">]</span> = i; sz<span style="color: #7388D6;">[</span>i<span style="color: #7388D6;">]</span> += sz<span style="color: #7388D6;">[</span>j<span style="color: #7388D6;">]</span>; <span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Weighted Quick Union Analysis</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<b>Running time:</b>
</p>
<ul class="org-ul">
<li>Find: takes time proportional to depth of <code>p</code> and <code>q</code>.
</li>
<li>Union: takes constant time, given roots.
</li>
</ul>

<p>
<b>Proposition:</b> Depth of any node <code>x</code> is at most <code>lg N</code> (logarithm base 2 is always represented as <code>lg N</code>).
</p>

<p>
<b>Pf:</b> When does depth of <code>x</code> increase?
</p>

<p>
Increases by 1 when tree <code>T1</code> containing <code>x</code> is merged into another tree <code>T2</code>.
</p>

<ul class="org-ul">
<li>The size of the tree containing <code>x</code> at least doubles since:
</li>
</ul>

<pre class="example">
|T2| &gt;= |T1|
</pre>

<ul class="org-ul">
<li>Size of tree containing <code>x</code> can double at most <code>log N</code> times. Why?
</li>
</ul>

<p>
That means that, in order to have a tree that is 30 levels deep, we would need to have an <code>N</code> of over 1 billion:
</p>

<pre class="example">
Math.pow(2, 30) // 1073741824
</pre>

<p>
<b>Running time.</b>
</p>
<ul class="org-ul">
<li>Find: takes time proportional to depth of <code>p</code> and <code>q</code>.
</li>
<li>Union: takes constant time, given roots.
</li>
</ul>

<p>
<b>Proposition:</b> Depth of any node <code>x</code> is at most <code>lg N</code>.
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">algorithm</th>
<th scope="col" class="text-left">intiailize</th>
<th scope="col" class="text-left">union</th>
<th scope="col" class="text-left">connected</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">quick find</td>
<td class="text-left">N</td>
<td class="text-left">N</td>
<td class="text-left">1</td>
</tr>

<tr>
<td class="text-left">quick union</td>
<td class="text-left">N</td>
<td class="text-left">N †</td>
<td class="text-left">N</td>
</tr>

<tr>
<td class="text-left">weighted QU</td>
<td class="text-left">N</td>
<td class="text-left">lg N †</td>
<td class="text-left">lg N</td>
</tr>
</tbody>
</table>

<p>
† includes cost of finding roots
</p>

<p>
<b>Q.</b> Stop at guaranteed acceptable performance?
<b>A.</b> No, easy to improve further.
</p>
</div>
</div>
