part_i/notes/15UnionFind.org
*** Improvement 2: Path compression

*Quick union with path compression.* Just after computing the root of =p=, set the id of each examined node to point to that root.

Put differently, along the way to checking the root of a given node, on the way we might as well also have each node now point directly to that root node (eliminating increasingly expensive lookups).

*** Path compression: Java implementation

#+BEGIN_SRC java
private int root(int i)
{
  while(i != id[i])
    {
      id[i] = id[id[i]]; // only 1 extra line of code!
      i = id[i];
    }
  return i;
}
#+END_SRC

In practice, no reason not to! This implementation keeps the tree /almost completely flat/. Now, every node points to its grandparent.

*** Weighted quick union with path compression: amortized analysis

_From Wikipedia_: “In computer science, amortized analysis is a method for analyzing a given algorithm's time complexity, or how much of a resource, especially time or memory, it takes to execute. The motivation for amortized analysis is that looking at the worst-case run time per operation can be too pessimistic.”

*Proposition:* [[https://www.coursera.org/learn/algorithms-greedy][Course: {Hopcroft-Ulman, Tarjan}]]

Starting from an empty data structure, any sequence of =M= union find ops on =N= objects makes...
#+BEGIN_SRC
<= c (N + M lg * N)
#+END_SRC

...array accesses.

- Analysis can be improved to =N + M α (M, N)=.
- Simple algorithm with fascinating mathematics.

|       N | lg * N |
|---------+--------|
|       1 |      0 |
|       2 |      1 |
|       4 |      2 |
|      16 |      3 |
|   65536 |      4 |
| 2^65536 |      5 |

=lg * N= is kind of a funny function; it represents the number of times you have to take the log of =N= to get 1, otherwise known as the *iterate log function*. In the real world, it’s best to think of this number as something that can, at most, represent 5.

Because of this, we can think of the weighted quick union with path compression as /linear/ in the real world. There is also another, more interesting function called the [[https://en.wikipedia.org/wiki/Ackermann_function][Ackermann function]] which grows even more slowly than =lg * N=.

Here is that function as represented on page 36 exercise 1.10 in [[https://mitpress.mit.edu/books/structure-and-interpretation-computer-programs][Structure and Interpretation of Computer Progams]]:

#+BEGIN_SRC lisp
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
              (A x (- y 1))))))

(A 1 10) ;; 1024
(A 2 4)  ;; 65536
(A 3 3)  ;; 65536
#+END_SRC

This leads us to ask the question: is there a linear-time algorithm for =M= union find ops on =N= objects?

- Cost within constant factor of reading in the data.
- In theory, WQUPC is not quite linear.
- In practice, WQUPC is linear.

The answer is that we can prove that there is no such algorithm for union find that operates on linear time. This was proven by Friedman and Sachs (neither of whom could I find anything about online?).

*** Summary

*Bottom line.* Weighted quick union (with path compression) makes it possible to solve problems that could not otherwise be addressed.

| algorithm                      | worst-case time |
|--------------------------------+-----------------|
| quick find                     | =M N=           |
| quick union                    | =M N=           |
| weighted QU                    | =N + M log N=   |
| QU + path compression          | =N + M log N=   |
| weighted QU + path compression | =N + M lg * N=  |

/Above: M union-find operations on a set of N objects/

*Ex.* [10^9 unions and finds with 10^9 objects]
- WQUPC reduces time from 30 years to 6 seconds.
- Supercomputer won’t help much; good algorithm enables solution.


** Union-Find Applications

There is a huge number of problems and applications for union-find, including:

- Percolation
- Games (Go, Hex)
- Dynamic connectivity
- Least common ancestor
- Equivalence of finite state automata
- Hoshen-Kopelman algorithm in physics
- [[http://akgupta.ca/blog/2013/05/14/so-you-still-dont-understand-hindley-milner/][Hinley-Milner polymorphic type inference]]
- Kruskal’s minimum spanning tree algorithm
- Compiling equivalence statements in Fortran
- Morphological attribute openings and closings
- Matlab’s =bwlabel()= function in image processing

