part_i/notes/15UnionFind.html

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Improvement 2: Path compression</h3>
<div class="outline-text-3" id="text-5-4">
<p>
<b>Quick union with path compression.</b> Just after computing the root of <code>p</code>, set the id of each examined node to point to that root.
</p>

<p>
Put differently, along the way to checking the root of a given node, on the way we might as well also have each node now point directly to that root node (eliminating increasingly expensive lookups).
</p>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Path compression: Java implementation</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">root</span><span style="color: #707183;">(</span><span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
  <span style="color: #0000FF;">while</span><span style="color: #7388D6;">(</span>i != id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span>
    <span style="color: #7388D6;">{</span>
      id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span> = id<span style="color: #909183;">[</span>id<span style="color: #709870;">[</span>i<span style="color: #709870;">]</span><span style="color: #909183;">]</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">only 1 extra line of code!</span>
      i = id<span style="color: #909183;">[</span>i<span style="color: #909183;">]</span>;
    <span style="color: #7388D6;">}</span>
  <span style="color: #0000FF;">return</span> i;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
In practice, no reason not to! This implementation keeps the tree <i>almost completely flat</i>. Now, every node points to its grandparent.
</p>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Weighted quick union with path compression: amortized analysis</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<span class="underline">From Wikipedia</span>: “In computer science, amortized analysis is a method for analyzing a given algorithm's time complexity, or how much of a resource, especially time or memory, it takes to execute. The motivation for amortized analysis is that looking at the worst-case run time per operation can be too pessimistic.”
</p>

<p>
<b>Proposition:</b> <a href="https://www.coursera.org/learn/algorithms-greedy">Course: {Hopcroft-Ulman, Tarjan}</a>
</p>

<p>
Starting from an empty data structure, any sequence of <code>M</code> union find ops on <code>N</code> objects makes&#x2026;
</p>
<pre class="example">
&lt;= c (N + M lg * N)
</pre>

<p>
&#x2026;array accesses.
</p>

<ul class="org-ul">
<li>Analysis can be improved to <code>N + M α (M, N)</code>.
</li>
<li>Simple algorithm with fascinating mathematics.
</li>
</ul>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="right">

<col  class="right">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-right">N</th>
<th scope="col" class="text-right">lg * N</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-right">1</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-right">2</td>
<td class="text-right">1</td>
</tr>

<tr>
<td class="text-right">4</td>
<td class="text-right">2</td>
</tr>

<tr>
<td class="text-right">16</td>
<td class="text-right">3</td>
</tr>

<tr>
<td class="text-right">65536</td>
<td class="text-right">4</td>
</tr>

<tr>
<td class="text-right">2<sup>65536</sup></td>
<td class="text-right">5</td>
</tr>
</tbody>
</table>

<p>
<code>lg * N</code> is kind of a funny function; it represents the number of times you have to take the log of <code>N</code> to get 1, otherwise known as the <b>iterate log function</b>. In the real world, it’s best to think of this number as something that can, at most, represent 5.
</p>

<p>
Because of this, we can think of the weighted quick union with path compression as <i>linear</i> in the real world. There is also another, more interesting function called the <a href="https://en.wikipedia.org/wiki/Ackermann_function">Ackermann function</a> which grows even more slowly than <code>lg * N</code>.
</p>

<p>
Here is that function as represented on page 36 exercise 1.10 in <a href="https://mitpress.mit.edu/books/structure-and-interpretation-computer-programs">Structure and Interpretation of Computer Progams</a>:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #707183;">(</span>define <span style="color: #7388D6;">(</span>A x y<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>= y <span style="color: #D0372D;">0</span><span style="color: #709870;">)</span> <span style="color: #D0372D;">0</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>= x <span style="color: #D0372D;">0</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>* <span style="color: #D0372D;">2</span> y<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>= y <span style="color: #D0372D;">1</span><span style="color: #709870;">)</span> <span style="color: #D0372D;">2</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>else <span style="color: #709870;">(</span>A <span style="color: #907373;">(</span>- x <span style="color: #D0372D;">1</span><span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>A x <span style="color: #6276BA;">(</span>- y <span style="color: #D0372D;">1</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>A <span style="color: #D0372D;">1</span> <span style="color: #D0372D;">10</span><span style="color: #707183;">)</span> <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">1024</span>
<span style="color: #707183;">(</span>A <span style="color: #D0372D;">2</span> <span style="color: #D0372D;">4</span><span style="color: #707183;">)</span>  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">65536</span>
<span style="color: #707183;">(</span>A <span style="color: #D0372D;">3</span> <span style="color: #D0372D;">3</span><span style="color: #707183;">)</span>  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">65536</span>
</pre>
</div>

<p>
This leads us to ask the question: is there a linear-time algorithm for <code>M</code> union find ops on <code>N</code> objects?
</p>

<ul class="org-ul">
<li>Cost within constant factor of reading in the data.
</li>
<li>In theory, WQUPC is not quite linear.
</li>
<li>In practice, WQUPC is linear.
</li>
</ul>

<p>
The answer is that we can prove that there is no such algorithm for union find that operates on linear time. This was proven by Friedman and Sachs (neither of whom could I find anything about online?).
</p>
</div>
</div>

<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> Summary</h3>
<div class="outline-text-3" id="text-5-7">
<p>
<b>Bottom line.</b> Weighted quick union (with path compression) makes it possible to solve problems that could not otherwise be addressed.
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">algorithm</th>
<th scope="col" class="text-left">worst-case time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">quick find</td>
<td class="text-left"><code>M N</code></td>
</tr>

<tr>
<td class="text-left">quick union</td>
<td class="text-left"><code>M N</code></td>
</tr>

<tr>
<td class="text-left">weighted QU</td>
<td class="text-left"><code>N + M log N</code></td>
</tr>

<tr>
<td class="text-left">QU + path compression</td>
<td class="text-left"><code>N + M log N</code></td>
</tr>

<tr>
<td class="text-left">weighted QU + path compression</td>
<td class="text-left"><code>N + M lg * N</code></td>
</tr>
</tbody>
</table>

<p>
<i>Above: M union-find operations on a set of N objects</i>
</p>

<p>
<b>Ex.</b> [10<sup>9</sup> unions and finds with 10<sup>9</sup> objects]
</p>
<ul class="org-ul">
<li>WQUPC reduces time from 30 years to 6 seconds.
</li>
<li>Supercomputer won’t help much; good algorithm enables solution.
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Union-Find Applications</h2>
<div class="outline-text-2" id="text-6">
<p>
There is a huge number of problems and applications for union-find, including:
</p>

<ul class="org-ul">
<li>Percolation
</li>
<li>Games (Go, Hex)
</li>
<li>Dynamic connectivity
</li>
<li>Least common ancestor
</li>
<li>Equivalence of finite state automata
</li>
<li>Hoshen-Kopelman algorithm in physics
</li>
<li><a href="http://akgupta.ca/blog/2013/05/14/so-you-still-dont-understand-hindley-milner/">Hinley-Milner polymorphic type inference</a>
</li>
<li>Kruskal’s minimum spanning tree algorithm
</li>
<li>Compiling equivalence statements in Fortran
</li>
<li>Morphological attribute openings and closings
</li>
<li>Matlab’s <code>bwlabel()</code> function in image processing
</li>
</ul>
</div>
